АлогистикТест2/src/AccumulationRegisters/алк_ПроизводствоОборот/алк_ПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ПроизводствоОборот</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвиженияПроизводства</name>
    <type>
      <types>EnumRef.алк_ВидыДвиженияПроизводствоОборот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов/алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов</name>
  <attributes>
    <name>ВременнаяМетка</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОперацияПроизводства</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.алк_ВидЗначенияПоказателяОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ВидЗначенияПоказателяОтчетов/алк_ВидЗначенияПоказателяОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидЗначенияПоказателяОтчетов</name>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Бюджет</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/AccumulationRegisters/алк_ПроизводствоОборот/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	Если ЭтотОбъект.ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	СписокОпераций = ЭтотОбъект.Выгрузить(,"ДатаСмены, Операция");
	СписокОпераций.Свернуть("ДатаСмены, Операция");
	Для каждого СтрокаОпераций из СписокОпераций Цикл
		РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
			СтрокаОпераций.ДатаСмены,
			СтрокаОпераций.Операция,
			Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ОтборРегистратор = ЭтотОбъект.Отбор.Найти("Регистратор");
	Если ОтборРегистратор <> Неопределено тогда
		УстановитьПривилегированныйРежим(Истина);
		Запрос = новый Запрос(
		"ВЫБРАТЬ
		|	МИНИМУМ(алк_ПроизводствоОборот.Период) КАК ПериодРасчета,
		|	алк_ПроизводствоОборот.Операция КАК ОперацияПроизводства
		|ИЗ
		|	РегистрНакопления.алк_ПроизводствоОборот КАК алк_ПроизводствоОборот
		|ГДЕ
		|	алк_ПроизводствоОборот.Регистратор = &Регистратор
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ПроизводствоОборот.Операция");
		Запрос.УстановитьПараметр("Регистратор", 	ОтборРегистратор.Значение);
		РезультатЗапрос = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапрос.Следующий() Цикл
			РегистрыСведений.алк_ЗаданияДляРасчетаЗначенийПоказателейДляОтчетов.ДобавитьЗадание(
				РезультатЗапрос.ПериодРасчета,
				РезультатЗапрос.ОперацияПроизводства,
				Перечисления.алк_ВидЗначенияПоказателяОтчетов.Факт);
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры
